Repository: gee1k/uPic
Catalog: macOS/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: (optional), When filled, URL = domain + URL path value
zh_hans: （可选），填写后，URL = 域名 + URL路径值

source: %lld Items
zh_hans: %lld 个项目

source: About
zh_hans: 关于

source: Acknowledgments
zh_hans: 致谢

source: Add a host here
zh_hans: 在这里添加图床

source: Add new body
zh_hans: 添加新的请求体

source: Add new header
zh_hans: 添加新的请求头

source: Advance
zh_hans: 高级

source: After uploading images, the history will be displayed here.
zh_hans: 上传图片后，历史记录将显示在这里。

source: Already have one? Go get it!
zh_hans: 已经有账户了？去获取一个！

source: API URL
zh_hans: API 地址

source: App is already running
zh_hans: 应用已在运行

source: Application
zh_hans: 应用

source: Are you sure you want to clear all upload history? This action cannot be undone.
zh_hans: 确定要清除所有上传历史吗？此操作无法撤销。

source: Are you sure you want to reset all settings? This action cannot be undone and will remove all your custom menu items and preferences.
zh_hans: 确定要重置所有设置吗？此操作无法撤销，将删除所有自定义菜单项和偏好设置。

source: Authorize
zh_hans: 授权

source: Auto clipboard
zh_hans: 自动复制到剪贴板

source: Auto clipboard %@
zh_hans: 自动复制到剪贴板 %@

source: Body
zh_hans: 请求体

source: Body Key
zh_hans: 请求体键

source: Body Value
zh_hans: 请求体值

source: Branch
zh_hans: 分支

source: Bucket
zh_hans: 存储桶

source: Can be empty, there is a default domain
zh_hans: 可以为空，有默认域名

source: Cancel
zh_hans: 取消

source: Cancel upload
zh_hans: 取消上传

source: Clear
zh_hans: 清除

source: Clear History Record
zh_hans: 清除历史记录

source: Compress before uploading %@
zh_hans: 上传前压缩 %@

source: Config
zh_hans: 配置

source: Configuration export error!
zh_hans: 配置导出错误！

source: Contact
zh_hans: 联系

source: Copy URL
zh_hans: 复制 URL

source: Copy URL to clipboard automatically after a successful upload.
zh_hans: 成功上传后自动复制 URL 到剪贴板。

source: Custom name
zh_hans: 自定义名称

source: Customize
zh_hans: 自定义

source: Database
zh_hans: 数据库

source: Delete
zh_hans: 删除

source: Delete body
zh_hans: 删除请求体

source: Delete format
zh_hans: 删除格式

source: Delete header
zh_hans: 删除请求头

source: Disabled
zh_hans: 关闭

source: Disk Access Permission
zh_hans: 磁盘访问权限

source: Disk full access permission not granted.
zh_hans: 磁盘完全访问权限未授权。

source: Domain
zh_hans: 域名

source: Email
zh_hans: 邮箱

source: Enabled
zh_hans: 开启

source: Endpoint
zh_hans: 服务端点

source: Export Logs
zh_hans: 导出日志

source: File Field
zh_hans: 文件字段

source: File Name
zh_hans: 文件名

source: Format
zh_hans: 格式

source: Format Name
zh_hans: 格式名称

source: Format Value
zh_hans: 格式值

source: Frame
zh_hans: 尺寸

source: Full disk access
zh_hans: 完全磁盘访问

source: Full disk access permission granted successfully!
zh_hans: 磁盘完全访问权限已成功授予！

source: General
zh_hans: 通用

source: Get API Token
zh_hans: 获取 API Token

source: Get Client ID
zh_hans: 获取 Client ID

source: Header
zh_hans: 请求头

source: Header Key
zh_hans: 请求头键

source: Header Value
zh_hans: 请求头值

source: Headers and Bodies Customization
zh_hans: 请求头和请求体自定义

source: History
zh_hans: 历史记录

source: Home Page
zh_hans: 主页

source: Host
zh_hans: 图床

source: Host %@
zh_hans: 图床 %@

source: Import failed
zh_hans: 导入失败

source: Invalid file path
zh_hans: 无效的文件路径

source: Key
zh_hans: 键

source: Keyboard Shortcuts
zh_hans: 键盘快捷键

source: Launch at login
zh_hans: 登录时启动

source: License
zh_hans: 许可证

source: Logs
zh_hans: 日志

source: Logs file export failed: %@
zh_hans: 日志文件导出失败: %@

source: Logs file successfully exported to: %@
zh_hans: 日志文件成功导出到: %@

source: Main Controls
zh_hans: 主要控制

source: Method
zh_hans: 请求方式

source: Name
zh_hans: 名称

source: No access to file!
zh_hans: 无法访问文件！

source: No available hosts configuration
zh_hans: 没有可用的图床配置

source: No history yet
zh_hans: 暂无历史记录

source: No Host Selected
zh_hans: 未选择图床

source: No host yet
zh_hans: 无图床配置

source: No upload history
zh_hans: 无上传历史

source: Not created before? Go get one!
zh_hans: 以前没有创建过？去获取一个！

source: Note: Please use {url} {filename} as placeholder for your url
zh_hans: 注意：请使用 {url} {filename} 作为您 URL 的占位符

source: Notification
zh_hans: 通知

source: Number to display
zh_hans: 显示数量

source: OK
zh_hans: 确定

source: Open in Browser
zh_hans: 在浏览器中打开

source: Open Source
zh_hans: 开源

source: Open Source Libraries
zh_hans: 开源库

source: Open Source Licenses
zh_hans: 开源许可证

source: Open System Preferences
zh_hans: 打开系统偏好设置

source: Operator
zh_hans: 操作员

source: Operator name
zh_hans: 操作员名称

source: Operator password
zh_hans: 操作员密码

source: Other fields
zh_hans: 其他字段

source: Output Format
zh_hans: 输出格式

source: Output format %@
zh_hans: 输出格式 %@

source: Output Format Customization
zh_hans: 输出格式自定义

source: Output format encoded %@
zh_hans: 输出格式编码 %@

source: Output url format
zh_hans: 输出 URL 格式

source: Output URL:
zh_hans: 输出 URL：

source: Password
zh_hans: 密码

source: Path and URL of the file to upload
zh_hans: 要上传文件的路径和 URL

source: Permissions
zh_hans: 权限

source: Please add a host first
zh_hans: 请先添加一个图床

source: Please allow uPic to access screen recording in System Preferences > Security & Privacy > Screen Recording.
zh_hans: 请在系统偏好设置 > 安全性与隐私 > 屏幕录制中允许 uPic 访问屏幕录制。

source: Please do NOT delete the info below
zh_hans: 请勿删除以下信息

source: Preferences
zh_hans: 偏好设置

source: Preview
zh_hans: 预览

source: Print this help message
zh_hans: 打印此帮助信息

source: Quality
zh_hans: 质量

source: Quit
zh_hans: 退出

source: Rate App
zh_hans: 评价应用

source: Region
zh_hans: 区域

source: Repo
zh_hans: 仓库

source: Request
zh_hans: 请求

source: Required for accessing files on your Mac
zh_hans: 访问您 Mac 上的文件所必需的权限

source: Reset
zh_hans: 重置

source: Reset all settings
zh_hans: 重置所有设置

source: Reset All Settings
zh_hans: 重置所有设置

source: Result Path
zh_hans: 结果路径

source: Right click to cancel the current upload task
zh_hans: 右键点击取消当前上传任务

source: Save
zh_hans: 保存

source: Save Key
zh_hans: 保存路径

source: Screen Recording Permission Required
zh_hans: 需要屏幕录制权限

source: Screenshot App
zh_hans: 截图应用

source: Select a host from the list
zh_hans: 从列表中选择一个图床

source: Send notification after uploading.
zh_hans: 上传完成后发送通知

source: Settings Management
zh_hans: 设置管理

source: Size
zh_hans: 大小

source: Status Menu History
zh_hans: 状态栏历史记录

source: Successfully
zh_hans: 成功

source: Supports {year} {month} {day} {hour} {minute} {second} {since_second} {since_millisecond} {random} {filename} {.suffix} {suffix} {mimetype} {saveKey} and etc.
zh_hans: 支持 {year} {month} {day} {hour} {minute} {second} {since_second} {since_millisecond} {random} {filename} {.suffix} {suffix} {mimetype} {saveKey} 等变量。

source: Supports {year} {month} {day} {hour} {minute} {second} {since_second} {since_millisecond} {random} {filename} {.suffix} {suffix} {mimetype} and etc. For example, the uploaded file is uPic.jpg, set to "uPic/{filename}{.suffix}", it will be saved as: uPic/uPic.jpg.
zh_hans: 支持 {year} {month} {day} {hour} {minute} {second} {since_second} {since_millisecond} {random} {filename} {.suffix} {suffix} {mimetype} 等变量。例如，上传的文件为 uPic.jpg，设置为 "uPic/{filename}{.suffix}"，将保存为：uPic/uPic.jpg。

source: System
zh_hans: 系统

source: Test
zh_hans: 测试

source: The configuration file is exported successfully, Do not modify the file contents!
zh_hans: 配置文件导出成功，请勿修改文件内容！

source: The configuration file is invalid, please check!
zh_hans: 配置文件无效，请检查！

source: The configuration has been imported, please check and use!
zh_hans: 配置已导入，请检查并使用！

source: The current upload task is not complete
zh_hans: 当前上传任务未完成

source: The file does not exist or has been deleted!
zh_hans: 文件不存在或已被删除！

source: The path to the URL field in Response JSON
zh_hans: 响应 JSON 中 URL 字段的路径

source: The suffix added during the visit does not affect the upload(also supports variables). Can be used as object storage for image processing styles, etc ... For example: !w means get a watermarked image.
zh_hans: 访问时添加的后缀不影响上传（也支持变量）。可用作对象存储的图片处理样式等...例如：!w 表示获取带水印的图片。

source: Thumbnail
zh_hans: 缩略图

source: Thumbnail Size
zh_hans: 缩略图大小

source: Thumbs up in App Store
zh_hans: 在 App Store 中点赞

source: Turn off error message output
zh_hans: 关闭错误消息输出

source: Unable to access logs directory.
zh_hans: 无法访问日志目录。

source: Unknown
zh_hans: 未知

source: Unknown host type
zh_hans: 未知的图床类型

source: uPic Database
zh_hans: uPic 数据库

source: uPic Settings
zh_hans: uPic 设置

source: uPic will automatically launch at login.
zh_hans: uPic 将在登录时自动启动。

source: Upload failed
zh_hans: 上传失败

source: Upload from clipboard
zh_hans: 剪贴板上传

source: Upload from screenshot
zh_hans: 截图上传

source: Upload from screenshot %@
zh_hans: 截图上传 %@

source: Upload from select file
zh_hans: 选择文件上传

source: Upload Time
zh_hans: 上传时间

source: Uploaded successfully
zh_hans: 上传成功

# Uploading %lld/%lld
source: Uploading %1$lld/%2$lld
zh_hans: 正在上传 %1$lld/%2$lld

source: Uploading...
zh_hans: 正在上传...

source: URL has been copied to the clipboard
zh_hans: URL 已复制到剪贴板

source: Use Base64
zh_hans: 使用 Base64

source: User Name
zh_hans: 用户名

source: Validate
zh_hans: 验证

source: Value
zh_hans: 值

source: Version
zh_hans: 版本

source: View More...
zh_hans: 查看更多...

source: View on GitHub
zh_hans: 在 GitHub 上查看

source: You can use uPic://x-callback-url/acceptSnip to trigger an upload after a screenshot is taken, uPic will upload the screen shot image from clipboard.
zh_hans: 您可以使用 uPic://x-callback-url/acceptSnip 在截图完成后触发上传，uPic将从剪贴板上传截图图像。
